# יש לך רשימה של ציונים (מותר שיהיו כפילויות):
#
# grades = [78, 92, 65, 92, 81, 74, 99, 67, 88, 99]
#
# כללים:
#
# מיין את הרשימה מהגבוה לנמוך באמצעות מיון
# הדפס את 3 הציונים הגבוהים ביותר (מותר כפילויות)
# לאחר מכן מיין את הרשימה מהנמוך לגבוה
# הדפס את 3 הציונים הנמוכים ביותר
# אין להשתמש ב־set – הכפילויות חייבות להישאר
# רמז: אפשר להשתמש ב־sort או sorted

grades = [78, 92, 65, 92, 81, 74, 99, 67, 88, 99]

# מיין את הרשימה מהגבוה לנמוך באמצעות מיון
grades.sort(reverse=True)
print(grades)

# הדפס את 3 הציונים הגבוהים ביותר (מותר כפילויות)
print(grades[:3])

#  מיין את הרשימה מהנמוך לגבוה
grades.sort()
print(grades)

# הדפס את 3 הציונים הנמוכים ביותר
print(grades[3:])














